espressif/arduino-esp32/tools/ide-debug/svd/esp32s2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>APB_SARADC</name>
      <description>Successive Approximation Register Analog to Digital Converter</description>
      <groupName>APB_SARADC</groupName>
      <baseAddress>0x3F440000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x68</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>APB_ADC</name>
        <value>89</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>DIG ADC common configuration</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x407F8240</resetValue>
          <fields>
            <field>
              <name>START_FORCE</name>
              <description>0: select FSM to start SAR ADC. 1: select software to start SAR ADC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START</name>
              <description>Start SAR ADC by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WORK_MODE</name>
              <description>0: single-channel scan mode. 1: double-channel scan mode. 2:
alternate-channel scan mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_SEL</name>
              <description>0: select SAR ADC1. 1: select SAR ADC2, only work for single-channel scan mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_CLK_GATED</name>
              <description>SAR clock gate enable bit.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_CLK_DIV</name>
              <description>SAR clock divider</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_PATT_LEN</name>
              <description>0 ~ 15 means length 1 ~ 16</description>
              <bitOffset>15</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_PATT_LEN</name>
              <description>0 ~ 15 means length 1 ~ 16</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_PATT_P_CLEAR</name>
              <description>Clear the pointer of pattern table for DIG ADC1 CTRL.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_PATT_P_CLEAR</name>
              <description>Clear the pointer of pattern table for DIG ADC2 CTRL.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_SAR_SEL</name>
              <description>1: sar_sel will be coded to the MSB of the 16-bit output data, in this case the resolution should not be larger than 11 bits.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_TO_I2S</name>
              <description>1: I2S input data is from SAR ADC (for DMA), 0: I2S input data is from GPIO matrix</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XPD_SAR_FORCE</name>
              <description>Force option to xpd sar blocks.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT_ARB_CYCLE</name>
              <description>Wait arbit signal stable after sar_done.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <description>DIG ADC common configuration</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000A1FE</resetValue>
          <fields>
            <field>
              <name>MEAS_NUM_LIMIT</name>
              <description>Enable limit times of SAR ADC sample.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_MEAS_NUM</name>
              <description>Set maximum conversion number.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_INV</name>
              <description>1: data to DIG ADC1 CTRL is inverted, otherwise not.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR2_INV</name>
              <description>1: data to DIG ADC2 CTRL is inverted, otherwise not.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_SEL</name>
              <description>1: select saradc timer 0: i2s_ws trigger</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_TARGET</name>
              <description>Set SAR ADC timer target.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_EN</name>
              <description>Enable SAR ADC timer trigger.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM</name>
          <description>digital adc control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x02000000</resetValue>
          <fields>
            <field>
              <name>SAMPLE_NUM</name>
              <description>sample number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMPLE_CYCLE</name>
              <description>sample cycles</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_WAIT</name>
          <description>configure saradc fsm internal parameter base on test</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00FF0808</resetValue>
          <fields>
            <field>
              <name>XPD_WAIT</name>
              <description>xpd wait</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTB_WAIT</name>
              <description>reset time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STANDBY_WAIT</name>
              <description>standby wait</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR1_STATUS</name>
          <description>digital adc1 status</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR1_STATUS</name>
              <description>digital adc1 status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR2_STATUS</name>
          <description>digital adc2 status</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR2_STATUS</name>
              <description>digital adc2 status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR1_PATT_TAB1</name>
          <description>item 0 ~ 3 for pattern table 1 (each item one byte)</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F0F0F0F</resetValue>
          <fields>
            <field>
              <name>SAR1_PATT_TAB1</name>
              <description>item 0 ~ 3 for pattern table 1 (each item one byte)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR1_PATT_TAB2</name>
          <description>Item 4 ~ 7 for pattern table 1 (each item one byte)</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F0F0F0F</resetValue>
          <fields>
            <field>
              <name>SAR1_PATT_TAB2</name>
              <description>Item 4 ~ 7 for pattern table 1 (each item one byte)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR1_PATT_TAB3</name>
          <description>Item 8 ~ 11 for pattern table 1 (each item one byte)</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F0F0F0F</resetValue>
          <fields>
            <field>
              <name>SAR1_PATT_TAB3</name>
              <description>Item 8 ~ 11 for pattern table 1 (each item one byte)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR1_PATT_TAB4</name>
          <description>Item 12 ~ 15 for pattern table 1 (each item one byte)</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F0F0F0F</resetValue>
          <fields>
            <field>
              <name>SAR1_PATT_TAB4</name>
              <description>Item 12 ~ 15 for pattern table 1 (each item one byte)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR2_PATT_TAB1</name>
          <description>item 0 ~ 3 for pattern table 2 (each item one byte)</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F0F0F0F</resetValue>
          <fields>
            <field>
              <name>SAR2_PATT_TAB1</name>
              <description>item 0 ~ 3 for pattern table 2 (each item one byte)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR2_PATT_TAB2</name>
          <description>Item 4 ~ 7 for pattern table 2 (each item one byte)</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F0F0F0F</resetValue>
          <fields>
            <field>
              <name>SAR2_PATT_TAB2</name>
              <description>Item 4 ~ 7 for pattern table 2 (each item one byte)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR2_PATT_TAB3</name>
          <description>Item 8 ~ 11 for pattern table 2 (each item one byte)</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F0F0F0F</resetValue>
          <fields>
            <field>
              <name>SAR2_PATT_TAB3</name>
              <description>Item 8 ~ 11 for pattern table 2 (each item one byte)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR2_PATT_TAB4</name>
          <description>Item 12 ~ 15 for pattern table 2 (each item one byte)</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x0F0F0F0F</resetValue>
          <fields>
            <field>
              <name>SAR2_PATT_TAB4</name>
              <description>Item 12 ~ 15 for pattern table 2 (each item one byte)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_CTRL</name>
          <description>Configure the settings of DIG ADC2 arbiter</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000900</resetValue>
          <fields>
            <field>
              <name>ADC_ARB_APB_FORCE</name>
              <description>ADC2 arbiter forces to enable DIG ADC2 CTRL.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ARB_RTC_FORCE</name>
              <description>ADC2 arbiter forces to enable RTC ADC2 CTRL.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ARB_WIFI_FORCE</name>
              <description>ADC2 arbiter forces to enable PWDET/PKDET CTRL.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ARB_GRANT_FORCE</name>
              <description>ADC2 arbiter force grant.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ARB_APB_PRIORITY</name>
              <description>Set DIG ADC2 CTRL priority.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ARB_RTC_PRIORITY</name>
              <description>Set RTC ADC2 CTRL priority.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ARB_WIFI_PRIORITY</name>
              <description>Set PWDET/PKDET CTRL priority.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC_ARB_FIX_PRIORITY</name>
              <description>ADC2 arbiter uses fixed priority.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_CTRL</name>
          <description>Configure the settings of DIG ADC2 filter</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x20400000</resetValue>
          <fields>
            <field>
              <name>ADC2_FILTER_RESET</name>
              <description>Reset ADC2 filter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_FILTER_RESET</name>
              <description>Reset ADC1 filter.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_FILTER_FACTOR</name>
              <description>Set filter factor for DIG ADC2 CRTL.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_FILTER_FACTOR</name>
              <description>Set filter factor for DIG ADC1 CRTL.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_FILTER_EN</name>
              <description>Enable DIG ADC2 CRTL filter.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_FILTER_EN</name>
              <description>Enable DIG ADC1 CRTL filter.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FILTER_STATUS</name>
          <description>Data status of DIG ADC2 filter</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADC2_FILTER_DATA</name>
              <description>ADC2 filter data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1_FILTER_DATA</name>
              <description>ADC1 filter data.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>THRES_CTRL</name>
          <description>Configure monitor threshold for DIG ADC2</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Clock gate enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_THRES_MODE</name>
              <description>1: ADC_DATA > = threshold, generate interrupt. 0: ADC_DATA &lt; threshold, generate interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_THRES_MODE</name>
              <description>1: ADC_DATA > = threshold, generate interrupt. 0: ADC_DATA &lt; threshold, generate interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_THRES</name>
              <description>ADC2 threshold.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_THRES</name>
              <description>ADC1 threshold.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_THRES_EN</name>
              <description>Enable ADC2 threshold monitor.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_THRES_EN</name>
              <description>Enable ADC1 threshold monitor.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Enable DIG ADC interrupts</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADC2_THRES_INT_ENA</name>
              <description>Enable bit of APB_SARADC_ADC2_THRES_INT interrupt.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_THRES_INT_ENA</name>
              <description>Enable bit of APB_SARADC_ADC1_THRES_INT interrupt.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_DONE_INT_ENA</name>
              <description>Enable bit of APB_SARADC_ADC2_DONE_INT interrupt.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_DONE_INT_ENA</name>
              <description>Enable bit of APB_SARADC_ADC1_DONE_INT interrupt.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
