espressif/arduino-esp32/tools/ide-debug/svd/esp32s2.svd
        <register>
          <name>INTR_ST</name>
          <description>Masked interrupt status</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPIO0_INT_ST</name>
              <description>This is the status bit for DEDIC_GPIO0_INT_RAW when DEDIC_GPIO7_INT_ENA is set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO1_INT_ST</name>
              <description>This is the status bit for DEDIC_GPIO1_INT_RAW when DEDIC_GPIO7_INT_ENA is set to 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO2_INT_ST</name>
              <description>This is the status bit for DEDIC_GPIO2_INT_RAW when DEDIC_GPIO7_INT_ENA is set to 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO3_INT_ST</name>
              <description>This is the status bit for DEDIC_GPIO3_INT_RAW when DEDIC_GPIO7_INT_ENA is set to 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO4_INT_ST</name>
              <description>This is the status bit for DEDIC_GPIO4_INT_RAW when DEDIC_GPIO7_INT_ENA is set to 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO5_INT_ST</name>
              <description>This is the status bit for DEDIC_GPIO5_INT_RAW when DEDIC_GPIO7_INT_ENA is set to 1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO6_INT_ST</name>
              <description>This is the status bit for DEDIC_GPIO6_INT_RAW when DEDIC_GPIO7_INT_ENA is set to 1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GPIO7_INT_ST</name>
              <description>This is the status bit for DEDIC_GPIO7_INT_RAW when DEDIC_GPIO7_INT_ENA is set to 1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_CLR</name>
          <description>Interrupt clear bits</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPIO0_INT_CLR</name>
              <description>Set this bit to clear the DEDIC_GPIO0_INT_RAW interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO1_INT_CLR</name>
              <description>Set this bit to clear the DEDIC_GPIO1_INT_RAW interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO2_INT_CLR</name>
              <description>Set this bit to clear the DEDIC_GPIO2_INT_RAW interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO3_INT_CLR</name>
              <description>Set this bit to clear the DEDIC_GPIO3_INT_RAW interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO4_INT_CLR</name>
              <description>Set this bit to clear the DEDIC_GPIO4_INT_RAW interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO5_INT_CLR</name>
              <description>Set this bit to clear the DEDIC_GPIO5_INT_RAW interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO6_INT_CLR</name>
              <description>Set this bit to clear the DEDIC_GPIO6_INT_RAW interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GPIO7_INT_CLR</name>
              <description>Set this bit to clear the DEDIC_GPIO7_INT_RAW interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DS</name>
      <description>Digital Signature</description>
      <groupName>DS</groupName>
      <baseAddress>0x6003D000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA5C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>1584</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>C_MEM[%s]</name>
          <description>memory C</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IV_%s</name>
          <description>IV block data.</description>
          <addressOffset>0x630</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IV_0</name>
              <description>IV block data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>512</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>X_MEM[%s]</name>
          <description>memory X</description>
          <addressOffset>0x800</addressOffset>
          <size>0x8</size>
        </register>
        <register>
          <dim>512</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>Z_MEM[%s]</name>
          <description>memory Z</description>
          <addressOffset>0xA00</addressOffset>
          <size>0x8</size>
        </register>
        <register>
          <name>SET_START</name>
          <description>Activates the DS peripheral</description>
          <addressOffset>0xE00</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_START</name>
              <description>Write 1 to this register to activate the DS peripheral.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_ME</name>
          <description>Starts DS operation</description>
          <addressOffset>0xE04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_ME</name>
              <description>Write 1 to this register to start DS operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_FINISH</name>
          <description>Ends DS operation</description>
          <addressOffset>0xE08</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_FINISH</name>
              <description>Write 1 to this register to end DS operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_BUSY</name>
          <description>Status of the DS</description>
          <addressOffset>0xE0C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>QUERY_BUSY</name>
              <description>1: The DS peripheral is busy. 0: The DS peripheral is idle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_KEY_WRONG</name>
          <description>Checks the reason why DS_KEY is not ready.</description>
          <addressOffset>0xE10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>QUERY_KEY_WRONG</name>
              <description>1-15: HMAC was activated, but the DS peripheral did not successfully receive the DS_KEY value from the HMAC peripheral. The biggest value is 15. 0: HMAC is not activated.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_CHECK</name>
          <description>Queries DS check result</description>
          <addressOffset>0xE14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MD_ERROR</name>
              <description>1: MD check fails. 0: MD check passes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PADDING_BAD</name>
              <description>1: The padding check fails. 0: The padding check passes.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xE20</addressOffset>
          <size>0x20</size>
          <resetValue>0x20190418</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
