espressif/arduino-esp32/tools/ide-debug/svd/esp32s2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>INTERRUPT</name>
      <description>Interrupt</description>
      <groupName>INTERRUPT</groupName>
      <baseAddress>0x3F4C2000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x190</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WIFI_MAC</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>WIFI_MAC_NMI</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>WIFI_PWR</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>WIFI_BB</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>BT_MAC</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>BT_BB</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>BT_BB_NMI</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>RWBT</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>RWBLE</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>RWBT_NMI</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>RWBLE_NMI</name>
        <value>10</value>
      </interrupt>
      <registers>
        <register>
          <name>PRO_MAC_INTR_MAP</name>
          <description>MAC_INTR interrupt configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_MAC_INTR_MAP</name>
              <description>This register is used to map MAC_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_MAC_NMI_MAP</name>
          <description>MAC_NMI interrupt configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_MAC_NMI_MAP</name>
              <description>This register is used to map MAC_NMI interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PWR_INTR_MAP</name>
          <description>PWR_INTR interrupt configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PWR_INTR_MAP</name>
              <description>This register is used to map PWR_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_BB_INT_MAP</name>
          <description>BB_INT interrupt configuration register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_BB_INT_MAP</name>
              <description>This register is used to map BB_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_BT_MAC_INT_MAP</name>
          <description>BT_MAC_INT interrupt configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_BT_MAC_INT_MAP</name>
              <description>This register is used to map BT_MAC_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_BT_BB_INT_MAP</name>
          <description>BT_BB_INT interrupt configuration register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_BT_BB_INT_MAP</name>
              <description>This register is used to map BT_BB_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_BT_BB_NMI_MAP</name>
          <description>BT_BB_NMI interrupt configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_BT_BB_NMI_MAP</name>
              <description>This register is used to map BT_BB_NMI interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_RWBT_IRQ_MAP</name>
          <description>RWBT_IRQ interrupt configuration register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_RWBT_IRQ_MAP</name>
              <description>This register is used to map RWBT_IRQ interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_RWBLE_IRQ_MAP</name>
          <description>RWBLE_IRQ interrupt configuration register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_RWBLE_IRQ_MAP</name>
              <description>This register is used to map RWBLE_IRQ interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_RWBT_NMI_MAP</name>
          <description>RWBT_NMI interrupt configuration register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_RWBT_NMI_MAP</name>
              <description>This register is used to map RWBT_NMI interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_RWBLE_NMI_MAP</name>
          <description>RWBLE_NMI interrupt configuration register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_RWBLE_NMI_MAP</name>
              <description>This register is used to map RWBLE_NMI interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SLC0_INTR_MAP</name>
          <description>SLC0_INTR interrupt configuration register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SLC0_INTR_MAP</name>
              <description>This register is used to map SLC0_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SLC1_INTR_MAP</name>
          <description>SLC1_INTR interrupt configuration register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SLC1_INTR_MAP</name>
              <description>This register is used to map SLC1_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_UHCI0_INTR_MAP</name>
          <description>UHCI0_INTR interrupt configuration register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_UHCI0_INTR_MAP</name>
              <description>This register is used to map UHCI0_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_UHCI1_INTR_MAP</name>
          <description>UHCI1_INTR interrupt configuration register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_UHCI1_INTR_MAP</name>
              <description>This register is used to map UHCI1_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TG_T0_LEVEL_INT_MAP</name>
          <description>TG_T0_LEVEL_INT interrupt configuration register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG_T0_LEVEL_INT_MAP</name>
              <description>This register is used to map TG_T0_LEVEL_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TG_T1_LEVEL_INT_MAP</name>
          <description>TG_T1_LEVEL_INT interrupt configuration register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG_T1_LEVEL_INT_MAP</name>
              <description>This register is used to map TG_T1_LEVEL_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TG_WDT_LEVEL_INT_MAP</name>
          <description>TG_WDT_LEVEL_INT interrupt configuration register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG_WDT_LEVEL_INT_MAP</name>
              <description>This register is used to map TG_WDT_LEVEL_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TG_LACT_LEVEL_INT_MAP</name>
          <description>TG_LACT_LEVEL_INT interrupt configuration register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG_LACT_LEVEL_INT_MAP</name>
              <description>This register is used to map TG_LACT_LEVEL_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TG1_T0_LEVEL_INT_MAP</name>
          <description>TG1_T0_LEVEL_INT interrupt configuration register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG1_T0_LEVEL_INT_MAP</name>
              <description>This register is used to map TG1_T0_LEVEL_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TG1_T1_LEVEL_INT_MAP</name>
          <description>TG1_T1_LEVEL_INT interrupt configuration register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG1_T1_LEVEL_INT_MAP</name>
              <description>This register is used to map TG1_T1_LEVEL_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TG1_WDT_LEVEL_INT_MAP</name>
          <description>TG1_WDT_LEVEL_INT interrupt configuration register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG1_WDT_LEVEL_INT_MAP</name>
              <description>This register is used to map TG1_WDT_LEVEL_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_TG1_LACT_LEVEL_INT_MAP</name>
          <description>TG1_LACT_LEVEL_INT interrupt configuration register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG1_LACT_LEVEL_INT_MAP</name>
              <description>This register is used to map TG1_LACT_LEVEL_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_GPIO_INTERRUPT_PRO_MAP</name>
          <description>GPIO_INTERRUPT_PRO interrupt configuration register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_GPIO_INTERRUPT_PRO_MAP</name>
              <description>This register is used to map GPIO_INTERRUPT_PRO interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_GPIO_INTERRUPT_PRO_NMI_MAP</name>
          <description>GPIO_INTERRUPT_PRO_NMI interrupt configuration register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_GPIO_INTERRUPT_PRO_NMI_MAP</name>
              <description>This register is used to map GPIO_INTERRUPT_PRO_NMI interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_GPIO_INTERRUPT_APP_MAP</name>
          <description>GPIO_INTERRUPT_APP interrupt configuration register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_GPIO_INTERRUPT_APP_MAP</name>
              <description>This register is used to map GPIO_INTERRUPT_APP interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_GPIO_INTERRUPT_APP_NMI_MAP</name>
          <description>GPIO_INTERRUPT_APP_NMI interrupt configuration register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_GPIO_INTERRUPT_APP_NMI_MAP</name>
              <description>This register is used to map GPIO_INTERRUPT_APP_NMI interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DEDICATED_GPIO_IN_INTR_MAP</name>
          <description>DEDICATED_GPIO_IN_INTR interrupt configuration register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_DEDICATED_GPIO_IN_INTR_MAP</name>
              <description>This register is used to map DEDICATED_GPIO_IN_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_INTR_FROM_CPU_0_MAP</name>
          <description>CPU_INTR_FROM_CPU_0 interrupt configuration register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_CPU_INTR_FROM_CPU_0_MAP</name>
              <description>This register is used to map CPU_INTR_FROM_CPU_0 interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_INTR_FROM_CPU_1_MAP</name>
          <description>CPU_INTR_FROM_CPU_1 interrupt configuration register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_CPU_INTR_FROM_CPU_1_MAP</name>
              <description>This register is used to map CPU_INTR_FROM_CPU_1 interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_INTR_FROM_CPU_2_MAP</name>
          <description>CPU_INTR_FROM_CPU_2 interrupt configuration register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_CPU_INTR_FROM_CPU_2_MAP</name>
              <description>This register is used to map CPU_INTR_FROM_CPU_2 interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_INTR_FROM_CPU_3_MAP</name>
          <description>CPU_INTR_FROM_CPU_3 interrupt configuration register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_CPU_INTR_FROM_CPU_3_MAP</name>
              <description>This register is used to map CPU_INTR_FROM_CPU_3 interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SPI_INTR_1_MAP</name>
          <description>SPI_INTR_1 interrupt configuration register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SPI_INTR_1_MAP</name>
              <description>This register is used to map SPI_INTR_1 interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
