espressif/arduino-esp32/tools/ide-debug/svd/esp32s2.svd
        <register>
          <name>PRO_TG1_LACT_EDGE_INT_MAP</name>
          <description>TG1_LACT_EDGE_INT interrupt configuration register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_TG1_LACT_EDGE_INT_MAP</name>
              <description>This register is used to map TG1_LACT_EDGE_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CACHE_IA_INT_MAP</name>
          <description>CACHE_IA_INT interrupt configuration register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_CACHE_IA_INT_MAP</name>
              <description>This register is used to map CACHE_IA_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SYSTIMER_TARGET0_INT_MAP</name>
          <description>SYSTIMER_TARGET0_INT interrupt configuration register</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SYSTIMER_TARGET0_INT_MAP</name>
              <description>This register is used to map SYSTIMER_TARGET0_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SYSTIMER_TARGET1_INT_MAP</name>
          <description>SYSTIMER_TARGET1_INT interrupt configuration register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SYSTIMER_TARGET1_INT_MAP</name>
              <description>This register is used to map SYSTIMER_TARGET1_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SYSTIMER_TARGET2_INT_MAP</name>
          <description>SYSTIMER_TARGET2_INT interrupt configuration register</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SYSTIMER_TARGET2_INT_MAP</name>
              <description>This register is used to map SYSTIMER_TARGET2_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_ASSIST_DEBUG_INTR_MAP</name>
          <description>ASSIST_DEBUG_INTR interrupt configuration register</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_ASSIST_DEBUG_INTR_MAP</name>
              <description>This register is used to map ASSIST_DEBUG_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PMS_PRO_IRAM0_ILG_INTR_MAP</name>
          <description>PMS_PRO_IRAM0_ILG interrupt configuration register</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PMS_PRO_IRAM0_ILG_INTR_MAP</name>
              <description>This register is used to map PMS_PRO_IRAM0_ILG interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PMS_PRO_DRAM0_ILG_INTR_MAP</name>
          <description>PMS_PRO_DRAM0_ILG interrupt configuration register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PMS_PRO_DRAM0_ILG_INTR_MAP</name>
              <description>This register is used to map PMS_PRO_DRAM0_ILG interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PMS_PRO_DPORT_ILG_INTR_MAP</name>
          <description>PMS_PRO_DPORT_ILG interrupt configuration register</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PMS_PRO_DPORT_ILG_INTR_MAP</name>
              <description>This register is used to map PMS_PRO_DPORT_ILG interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PMS_PRO_AHB_ILG_INTR_MAP</name>
          <description>PMS_PRO_AHB_ILG interrupt configuration register</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PMS_PRO_AHB_ILG_INTR_MAP</name>
              <description>This register is used to map PMS_PRO_AHB_ILG interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PMS_PRO_CACHE_ILG_INTR_MAP</name>
          <description>PMS_PRO_CACHE_ILG interrupt configuration register</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PMS_PRO_CACHE_ILG_INTR_MAP</name>
              <description>This register is used to map PMS_PRO_CACHE_ILG interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PMS_DMA_APB_I_ILG_INTR_MAP</name>
          <description>PMS_DMA_APB_I_ILG  interrupt configuration register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PMS_DMA_APB_I_ILG_INTR_MAP</name>
              <description>This register is used to map PMS_DMA_APB_I_ILG interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PMS_DMA_RX_I_ILG_INTR_MAP</name>
          <description>PMS_DMA_RX_I_ILG interrupt configuration register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PMS_DMA_RX_I_ILG_INTR_MAP</name>
              <description>This register is used to map PMS_DMA_RX_I_ILG interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_PMS_DMA_TX_I_ILG_INTR_MAP</name>
          <description>PMS_DMA_TX_I_ILG interrupt configuration register</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_PMS_DMA_TX_I_ILG_INTR_MAP</name>
              <description>This register is used to map PMS_DMA_TX_I_ILG interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SPI_MEM_REJECT_INTR_MAP</name>
          <description>SPI_MEM_REJECT_INTR interrupt configuration register</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SPI_MEM_REJECT_INTR_MAP</name>
              <description>This register is used to map SPI_MEM_REJECT_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DMA_COPY_INTR_MAP</name>
          <description>DMA_COPY_INTR interrupt configuration register</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_DMA_COPY_INTR_MAP</name>
              <description>This register is used to map DMA_COPY_INTR interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SPI4_DMA_INT_MAP</name>
          <description>SPI4_DMA_INT interrupt configuration register</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SPI4_DMA_INT_MAP</name>
              <description>This register is used to map SPI4_DMA_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_SPI_INTR_4_MAP</name>
          <description>SPI_INTR_4 interrupt configuration register</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_SPI_INTR_4_MAP</name>
              <description>This register is used to map SPI_INTR_4 interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DCACHE_PRELOAD_INT_MAP</name>
          <description>DCACHE_PRELOAD_INT interrupt configuration register</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_DCACHE_PRELOAD_INT_MAP</name>
              <description>This register is used to map DCACHE_PRELOAD_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_ICACHE_PRELOAD_INT_MAP</name>
          <description>ICACHE_PRELOAD_INT interrupt configuration register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_ICACHE_PRELOAD_INT_MAP</name>
              <description>This register is used to map ICACHE_PRELOAD_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_APB_ADC_INT_MAP</name>
          <description>APB_ADC_INT interrupt configuration register</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_APB_ADC_INT_MAP</name>
              <description>This register is used to map APB_ADC_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CRYPTO_DMA_INT_MAP</name>
          <description>CRYPTO_DMA_INT interrupt configuration register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_CRYPTO_DMA_INT_MAP</name>
              <description>This register is used to map CRYPTO_DMA_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_CPU_PERI_ERROR_INT_MAP</name>
          <description>CPU_PERI_ERROR_INT interrupt configuration register</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_CPU_PERI_ERROR_INT_MAP</name>
              <description>This register is used to map CPU_PERI_ERROR_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_APB_PERI_ERROR_INT_MAP</name>
          <description>APB_PERI_ERROR_INT interrupt configuration register</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_APB_PERI_ERROR_INT_MAP</name>
              <description>This register is used to map APB_PERI_ERROR_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DCACHE_SYNC_INT_MAP</name>
          <description>DCACHE_SYNC_INT interrupt configuration register</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_DCACHE_SYNC_INT_MAP</name>
              <description>This register is used to map DCACHE_SYNC_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_ICACHE_SYNC_INT_MAP</name>
          <description>ICACHE_SYNC_INT interrupt configuration register</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PRO_ICACHE_SYNC_INT_MAP</name>
              <description>This register is used to map ICACHE_SYNC_INT interrupt signal to one of the CPU interrupts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_INTR_STATUS_0</name>
          <description>Interrupt status register 0</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_INTR_STATUS_0</name>
              <description>This register stores the status of the first 32 input interrupt sources.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_INTR_STATUS_1</name>
          <description>Interrupt status register 1</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_INTR_STATUS_1</name>
              <description>This register stores the status of the second 32 input interrupt sources.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_INTR_STATUS_2</name>
          <description>Interrupt status register 2</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_INTR_STATUS_2</name>
              <description>This register stores the status of the last 31 input interrupt sources.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>NMI interrupt signals mask register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>This bit is used to enable or disable the clock of interrupt matrix. 1: enable the clock. 0: disable the clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_NMI_MASK_HW</name>
              <description>This bit is used to disable all NMI interrupt signals to CPU.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REG_DATE</name>
          <description>Version control register</description>
          <addressOffset>0xFFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x01904180</resetValue>
          <fields>
            <field>
              <name>INTERRUPT_REG_DATE</name>
              <description>This is the version register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
