espressif/arduino-esp32/tools/ide-debug/svd/esp32s2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMS</name>
      <description>Permissions Controller</description>
      <groupName>PMS</groupName>
      <baseAddress>0x3F4C1000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SDIO_0</name>
          <description>SDIO permission control register 0.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SDIO_LOCK</name>
              <description>Lock register. Setting to 1 locks SDIO permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_1</name>
          <description>SDIO permission control register 1.</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SDIO_DISABLE</name>
              <description>Setting to 1 disables the SDIO function.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_DUMP_0</name>
          <description>MAC dump permission control register 0.</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MAC_DUMP_LOCK</name>
              <description>Lock register. Setting to 1 locks MAC dump permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_DUMP_1</name>
          <description>MAC dump permission control register 1.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x000000E4</resetValue>
          <fields>
            <field>
              <name>MAC_DUMP_CONNECT</name>
              <description>Configure MAC dump connection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_IRAM0_0</name>
          <description>IBUS permission control register 0.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_IRAM0_LOCK</name>
              <description>Lock register. Setting to 1 locks IBUS permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_IRAM0_1</name>
          <description>IBUS permission control register 1.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>PRO_IRAM0_SRAM_0_F</name>
              <description>Setting to 1 grants IBUS permission to fetch SRAM Block 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_0_R</name>
              <description>Setting to 1 grants IBUS permission to read SRAM Block 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_0_W</name>
              <description>Setting to 1 grants IBUS permission to write SRAM Block 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_1_F</name>
              <description>Setting to 1 grants IBUS permission to fetch SRAM Block 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_1_R</name>
              <description>Setting to 1 grants IBUS permission to read SRAM Block 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_1_W</name>
              <description>Setting to 1 grants IBUS permission to write SRAM Block 1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_2_F</name>
              <description>Setting to 1 grants IBUS permission to fetch SRAM Block 2.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_2_R</name>
              <description>Setting to 1 grants IBUS permission to read SRAM Block 2.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_2_W</name>
              <description>Setting to 1 grants IBUS permission to write SRAM Block 2.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_3_F</name>
              <description>Setting to 1 grants IBUS permission to fetch SRAM Block 3.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_3_R</name>
              <description>Setting to 1 grants IBUS permission to read SRAM Block 3.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_3_W</name>
              <description>Setting to 1 grants IBUS permission to write SRAM Block 3.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_IRAM0_2</name>
          <description>IBUS permission control register 2.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <resetValue>0x007E0000</resetValue>
          <fields>
            <field>
              <name>PRO_IRAM0_SRAM_4_SPLTADDR</name>
              <description>Configure the split address of SRAM Block 4-21 for IBUS access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_4_L_F</name>
              <description>Setting to 1 grants IBUS permission to fetch SRAM Block 4-21 low address region.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_4_L_R</name>
              <description>Setting to 1 grants IBUS permission to read SRAM Block 4-21 low address region.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_4_L_W</name>
              <description>Setting to 1 grants IBUS permission to write SRAM Block 4-21 low address region.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_4_H_F</name>
              <description>Setting to 1 grants IBUS permission to fetch SRAM Block 4-21 high address region.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_4_H_R</name>
              <description>Setting to 1 grants IBUS permission to read SRAM Block 4-21 high address region.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_SRAM_4_H_W</name>
              <description>Setting to 1 grants IBUS permission to write SRAM Block 4-21 high address region.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_IRAM0_3</name>
          <description>IBUS permission control register 3.</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0001F800</resetValue>
          <fields>
            <field>
              <name>PRO_IRAM0_RTCFAST_SPLTADDR</name>
              <description>Configure the split address of RTC FAST for IBUS access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_RTCFAST_L_F</name>
              <description>Setting to 1 grants IBUS permission to fetch RTC FAST low address region.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_RTCFAST_L_R</name>
              <description>Setting to 1 grants IBUS permission to read RTC FAST low address region.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_RTCFAST_L_W</name>
              <description>Setting to 1 grants IBUS permission to write RTC FAST low address region.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_RTCFAST_H_F</name>
              <description>Setting to 1 grants IBUS permission to fetch RTC FAST high address region.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_RTCFAST_H_R</name>
              <description>Setting to 1 grants IBUS permission to read RTC FAST high address region.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_RTCFAST_H_W</name>
              <description>Setting to 1 grants IBUS permission to write RTC FAST high address region.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_IRAM0_4</name>
          <description>IBUS permission control register 4.</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_IRAM0_ILG_CLR</name>
              <description>The clear signal for IBUS access interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_ILG_EN</name>
              <description>The enable signal for IBUS access interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_IRAM0_ILG_INTR</name>
              <description>IBUS access interrupt signal.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_IRAM0_5</name>
          <description>IBUS status register.</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_IRAM0_ILG_ST</name>
              <description>Record the illegitimate information of IBUS. [21:2]: store the bits [21:2] of IBUS address. [1]: 1 means data access, 0 means instruction access. [0]: 1 means write operation, 0 means read operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DRAM0_0</name>
          <description>DBUS permission control register 0.</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_DRAM0_LOCK</name>
              <description>Lock register. Setting to 1 locks DBUS0 permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DRAM0_1</name>
          <description>DBUS permission control register 1.</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x1E0000FF</resetValue>
          <fields>
            <field>
              <name>PRO_DRAM0_SRAM_0_R</name>
              <description>Setting to 1 grants DBUS0 permission to read SRAM Block 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_SRAM_0_W</name>
              <description>Setting to 1 grants DBUS0 permission to write SRAM Block 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_SRAM_1_R</name>
              <description>Setting to 1 grants DBUS0 permission to read SRAM Block 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_SRAM_1_W</name>
              <description>Setting to 1 grants DBUS0 permission to write SRAM Block 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_SRAM_2_R</name>
              <description>Setting to 1 grants DBUS0 permission to read SRAM Block 2.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_SRAM_2_W</name>
              <description>Setting to 1 grants DBUS0 permission to write SRAM Block 2.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_SRAM_3_R</name>
              <description>Setting to 1 grants DBUS0 permission to read SRAM Block 3.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_SRAM_3_W</name>
              <description>Setting to 1 grants DBUS0 permission to write SRAM Block 3.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_SRAM_4_SPLTADDR</name>
              <description>Configure the split address of SRAM Block 4-21 for DBUS0 access.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_SRAM_4_L_R</name>
              <description>Setting to 1 grants DBUS0 permission to read SRAM Block 4-21 low address region.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_SRAM_4_L_W</name>
              <description>Setting to 1 grants DBUS0 permission to write SRAM Block 4-21 low address region.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_SRAM_4_H_R</name>
              <description>Setting to 1 grants DBUS0 permission to read SRAM Block 4-21 high address region.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_SRAM_4_H_W</name>
              <description>Setting to 1 grants DBUS0 permission to write SRAM Block 4-21 high address region.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DRAM0_2</name>
          <description>DBUS permission control register 2.</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00007800</resetValue>
          <fields>
            <field>
              <name>PRO_DRAM0_RTCFAST_SPLTADDR</name>
              <description>Configure the split address of RTC FAST for DBUS0 access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_RTCFAST_L_R</name>
              <description>Setting to 1 grants DBUS0 permission to read RTC FAST low address region.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_RTCFAST_L_W</name>
              <description>Setting to 1 grants DBUS0 permission to write RTC FAST low address region.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_RTCFAST_H_R</name>
              <description>Setting to 1 grants DBUS0 permission to read RTC FAST high address region.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_RTCFAST_H_W</name>
              <description>Setting to 1 grants DBUS0 permission to write RTC FAST high address region.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DRAM0_3</name>
          <description>DBUS permission control register 3.</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_DRAM0_ILG_CLR</name>
              <description>The clear signal for DBUS0 access interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_ILG_EN</name>
              <description>The enable signal for DBUS0 access interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_DRAM0_ILG_INTR</name>
              <description>DBUS0 access interrupt signal.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DRAM0_4</name>
          <description>DBUS status register.</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_DRAM0_ILG_ST</name>
              <description>Record the illegitimate information of DBUS. [25:6]: store the bits [21:2] of DBUS address. [5]: 1 means atomic access, 0 means nonatomic access. [4]: 1 means write operation, 0 means read operation. [3:0]: DBUS0 bus byte enables.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_DPORT_0</name>
          <description>PeriBus1 permission control register 0.</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_DPORT_LOCK</name>
              <description>Lock register. Setting to 1 locks PeriBus1 permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
