espressif/arduino-esp32/tools/ide-debug/svd/esp32s2.svd
        <register>
          <name>DMA_APB_I_1</name>
          <description>Internal DMA permission control register 1.</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x1E0000FF</resetValue>
          <fields>
            <field>
              <name>DMA_APB_I_SRAM_0_R</name>
              <description>Setting to 1 grants internal DMA permission to read SRAM Block 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_SRAM_0_W</name>
              <description>Setting to 1 grants internal DMA permission to write SRAM Block 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_SRAM_1_R</name>
              <description>Setting to 1 grants internal DMA permission to read SRAM Block 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_SRAM_1_W</name>
              <description>Setting to 1 grants internal DMA permission to write SRAM Block 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_SRAM_2_R</name>
              <description>Setting to 1 grants internal DMA permission to read SRAM Block 2.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_SRAM_2_W</name>
              <description>Setting to 1 grants internal DMA permission to write SRAM Block 2.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_SRAM_3_R</name>
              <description>Setting to 1 grants internal DMA permission to read SRAM Block 3.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_SRAM_3_W</name>
              <description>Setting to 1 grants internal DMA permission to write SRAM Block 3.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_SRAM_4_SPLTADDR</name>
              <description>Configure the split address of SRAM Block 4-21 for internal DMA access.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_SRAM_4_L_R</name>
              <description>Setting to 1 grants internal DMA permission to read SRAM Block 4-21 low address region.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_SRAM_4_L_W</name>
              <description>Setting to 1 grants internal DMA permission to write SRAM Block 4-21 low address region.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_SRAM_4_H_R</name>
              <description>Setting to 1 grants internal DMA permission to read SRAM Block 4-21 high address region.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_SRAM_4_H_W</name>
              <description>Setting to 1 grants internal DMA permission to write SRAM Block 4-21 high address region.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APB_I_2</name>
          <description>Internal DMA permission control register 2.</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APB_I_ILG_CLR</name>
              <description>The clear signal for internal DMA access interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_ILG_EN</name>
              <description>The enable signal for internal DMA access interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_APB_I_ILG_INTR</name>
              <description>Internal DMA access interrupt signal.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_APB_I_3</name>
          <description>Internal DMA status register.</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_APB_I_ILG_ST</name>
              <description>Record the illegitimate information of Internal DMA. [22:6]: store the bits [18:2] of address. [5]: if bits [31:19] of address are 0x7ff, then the bit value is 1, otherwise it is 0. [4]: 1 means write operation, 0 means read operation. [3:0]: Internal DMA bus byte enables.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RX_I_0</name>
          <description>RX Copy DMA permission control register 0.</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_RX_I_LOCK</name>
              <description>Lock register. Setting to 1 locks RX Copy DMA permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RX_I_1</name>
          <description>RX Copy DMA permission control register 1.</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x1E0000FF</resetValue>
          <fields>
            <field>
              <name>DMA_RX_I_SRAM_0_R</name>
              <description>Setting to 1 grants RX Copy DMA permission to read SRAM Block 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_SRAM_0_W</name>
              <description>Setting to 1 grants RX Copy DMA permission to write SRAM Block 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_SRAM_1_R</name>
              <description>Setting to 1 grants RX Copy DMA permission to read SRAM Block 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_SRAM_1_W</name>
              <description>Setting to 1 grants RX Copy DMA permission to write SRAM Block 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_SRAM_2_R</name>
              <description>Setting to 1 grants RX Copy DMA permission to read SRAM Block 2.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_SRAM_2_W</name>
              <description>Setting to 1 grants RX Copy DMA permission to write SRAM Block 2.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_SRAM_3_R</name>
              <description>Setting to 1 grants RX Copy DMA permission to read SRAM Block 3.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_SRAM_3_W</name>
              <description>Setting to 1 grants RX Copy DMA permission to write SRAM Block 3.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_SRAM_4_SPLTADDR</name>
              <description>Configure the split address of SRAM Block 4-21 for RX Copy DMA access.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_SRAM_4_L_R</name>
              <description>Setting to 1 grants RX Copy DMA permission to read SRAM Block 4-21 low address region.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_SRAM_4_L_W</name>
              <description>Setting to 1 grants RX Copy DMA permission to write SRAM Block 4-21 low address region.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_SRAM_4_H_R</name>
              <description>Setting to 1 grants RX Copy DMA permission to read SRAM Block 4-21 high address region.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_SRAM_4_H_W</name>
              <description>Setting to 1 grants RX Copy DMA permission to write SRAM Block 4~21 high address region.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RX_I_2</name>
          <description>RX Copy DMA permission control register 2.</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_RX_I_ILG_CLR</name>
              <description>The clear signal for RX Copy DMA access interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_ILG_EN</name>
              <description>The enable signal for RX Copy DMA access interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_RX_I_ILG_INTR</name>
              <description>RX Copy DMA access interrupt signal.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RX_I_3</name>
          <description>RX Copy DMA status register.</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_RX_I_ILG_ST</name>
              <description>Record the illegitimate information of RX Copy DMA. [22:6]: store the bits [18:2] of address. [5]: if bits [31:19] of address are 0x7ff, then the bit value is 1, otherwise it is 0. [4]: 1 means write operation, 0 means read operation. [3:0]: RX Copy DMA bus byte enables.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_TX_I_0</name>
          <description>TX Copy DMA permission control register 0.</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_TX_I_LOCK</name>
              <description>Lock register. Setting to 1 locks TX Copy DMA permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_TX_I_1</name>
          <description>TX Copy DMA permission control register 1.</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x1E0000FF</resetValue>
          <fields>
            <field>
              <name>DMA_TX_I_SRAM_0_R</name>
              <description>Setting to 1 grants TX Copy DMA permission to read SRAM Block 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_SRAM_0_W</name>
              <description>Setting to 1 grants TX Copy DMA permission to write SRAM Block 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_SRAM_1_R</name>
              <description>Setting to 1 grants TX Copy DMA permission to read SRAM Block 1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_SRAM_1_W</name>
              <description>Setting to 1 grants TX Copy DMA permission to write SRAM Block 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_SRAM_2_R</name>
              <description>Setting to 1 grants TX Copy DMA permission to read SRAM Block 2.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_SRAM_2_W</name>
              <description>Setting to 1 grants TX Copy DMA permission to write SRAM Block 2.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_SRAM_3_R</name>
              <description>Setting to 1 grants TX Copy DMA permission to read SRAM Block 3.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_SRAM_3_W</name>
              <description>Setting to 1 grants TX Copy DMA permission to write SRAM Block 3.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_SRAM_4_SPLTADDR</name>
              <description>Configure the split address of SRAM Block 4-21 for TX Copy DMA access.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_SRAM_4_L_R</name>
              <description>Setting to 1 grants TX Copy DMA permission to read SRAM Block 4-21 low address region.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_SRAM_4_L_W</name>
              <description>Setting to 1 grants TX Copy DMA permission to write SRAM Block 4-21 low address region.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_SRAM_4_H_R</name>
              <description>Setting to 1 grants TX Copy DMA permission to read SRAM Block 4-21 high address region.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_SRAM_4_H_W</name>
              <description>Setting to 1 grants TX Copy DMA permission to write SRAM Block 4-21 high address region.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_TX_I_2</name>
          <description>TX Copy DMA permission control register 2.</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_TX_I_ILG_CLR</name>
              <description>The clear signal for TX Copy DMA access interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_ILG_EN</name>
              <description>The enable signal for TX Copy DMA access interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TX_I_ILG_INTR</name>
              <description>TX Copy DMA access interrupt signal.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_TX_I_3</name>
          <description>TX Copy DMA status register.</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_TX_I_ILG_ST</name>
              <description>Record the illegitimate information of TX Copy DMA. [22:6]: store the bits [18:2] of address. [5]: if bits [31:19] of address are 0x7ff, then the bit value is 1, otherwise it is 0. [4]: 1 means write operation, 0 means read operation. [3:0]: TX Copy DMA bus byte enables.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>23</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_BOOT_LOCATION_0</name>
          <description>Boot permission control register 0.</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_BOOT_LOCATION_LOCK</name>
              <description>Lock register. Setting to 1 locks boot remap permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRO_BOOT_LOCATION_1</name>
          <description>Boot permission control register 1.</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_BOOT_REMAP</name>
              <description>If set to 1, enable boot remap function.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_SOURCE_0</name>
          <description>Cache access permission control register 0.</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CACHE_SOURCE_LOCK</name>
              <description>Lock register. Setting to 1 locks cache access permission control registers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_SOURCE_1</name>
          <description>Cache access permission control register 1.</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRO_CACHE_I_SOURCE_PRO_IRAM1</name>
              <description>xx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CACHE_I_SOURCE_PRO_IROM0</name>
              <description>xx</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CACHE_I_SOURCE_PRO_DROM0</name>
              <description>xx</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CACHE_D_SOURCE_PRO_DRAM0</name>
              <description>xx</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CACHE_D_SOURCE_PRO_DPORT</name>
              <description>xx</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRO_CACHE_D_SOURCE_PRO_DROM0</name>
              <description>xx</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
