espressif/arduino-esp32/tools/ide-debug/svd/esp32s2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RMT</name>
      <description>Remote Control Peripheral</description>
      <groupName>RMT</groupName>
      <baseAddress>0x3F416000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RMT</name>
        <value>50</value>
      </interrupt>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%sDATA</name>
          <description>The read and write  data register for CHANNEL%s by apb fifo access.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH_DATA</name>
              <description>The read and write  data register for CHANNEL%s by apb fifo access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>CH%sCONF0</name>
          <description>Channel %s configure register 0</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x39100002</resetValue>
          <fields>
            <field>
              <name>DIV_CNT</name>
              <description>This register is used to configure the divider for clock of CHANNEL%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE_THRES</name>
              <description>When no edge is detected on the input signal and continuous clock cycles is longer than this register value, received process is finished.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_SIZE</name>
              <description>This register is used to configure the maximum size of memory allocated to CHANNEL%s.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_EFF_EN</name>
              <description>1: Add carrier modulation on the output signal only at the send data state for CHANNEL%s. 0: Add carrier modulation on the output signal at all state for CHANNEL%s. Only valid when RMT_CARRIER_EN_CH%s is 1.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_EN</name>
              <description>This is the carrier modulation enable-control bit for CHANNEL%s. 1: Add carrier modulation in the output signal. 0: No carrier modulation in sig_out.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_OUT_LV</name>
              <description>This bit is used to configure the position of carrier wave for CHANNEL%s.

1'h0: add carrier wave on low level.

1'h1: add carrier wave on high level.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>CH%sCONF1</name>
          <description>Channel %s configure register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000F20</resetValue>
          <fields>
            <field>
              <name>TX_START</name>
              <description>Set this bit to start sending data on CHANNEL%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_EN</name>
              <description>Set this bit to enable receiver to receive data on CHANNEL%s.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_WR_RST</name>
              <description>Set this bit to reset write ram address for CHANNEL%s by accessing receiver.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MEM_RD_RST</name>
              <description>Set this bit to reset read ram address for CHANNEL%s by accessing transmitter.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB_MEM_RST</name>
              <description>Set this bit to reset W/R ram address for CHANNEL%s by accessing apb fifo.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MEM_OWNER</name>
              <description>This register marks the ownership of CHANNEL%s's ram block.

1'h1: Receiver is using the ram. 

1'h0: Transmitter is using the ram.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CONTI_MODE</name>
              <description>Set this bit to restart transmission  from the first data to the last data in CHANNEL%s.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FILTER_EN</name>
              <description>This is the receive filter's enable bit for CHANNEL%s.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FILTER_THRES</name>
              <description>Ignores the input pulse when its width is smaller than this register value in APB clock periods (in receive mode).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHK_RX_CARRIER_EN</name>
              <description>Set this bit to enable memory loop read mode when carrier modulation is enabled for channel %s.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF_ALWAYS_ON</name>
              <description>This bit is used to select the base clock for CHANNEL%s.

1'h1: clk_apb    1'h0:clk_ref</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE_OUT_LV</name>
              <description>This bit configures the level of output signal in CHANNEL%s when the latter is in IDLE state.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE_OUT_EN</name>
              <description>This is the output enable-control bit for CHANNEL%s in IDLE state.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_STOP</name>
              <description>Set this bit to stop the transmitter of CHANNEL%s sending data out.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%sSTATUS</name>
          <description>Channel %s status register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MEM_WADDR_EX</name>
              <description>This register records the memory address offset when receiver of CHANNEL%s is using the RAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_RADDR_EX</name>
              <description>This register records the memory address offset when transmitter of CHANNEL%s is using the RAM.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE</name>
              <description>This register records the FSM status of CHANNEL%s.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_OWNER_ERR</name>
              <description>This status bit will be set when the ownership of memory block is wrong.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_FULL</name>
              <description>This status bit will be set if the receiver receives more data than the memory size.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_EMPTY</name>
              <description>This status bit will be set when the data to be set is more than memory size and the wraparound mode is disabled.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_WR_ERR</name>
              <description>This status bit will be set if the offset address out of memory size when writes via APB bus.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_RD_ERR</name>
              <description>This status bit will be set if the offset address out of memory size when reads via APB bus.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%sADDR</name>
          <description>Channel %s address register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB_MEM_WADDR</name>
              <description>This register records the memory address offset when writes RAM over APB bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_RADDR</name>
              <description>This register records the memory address offset when reads RAM over APB bus.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Raw interrupt status</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL%s. Triggered when transmission done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_RX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL%s. Triggered when reception done.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL%s. Triggered when error occurs.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL%s. Triggered when transmitter sent more data than configured value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_LOOP_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL%s. Triggered when the loop count reaches the configured threshold value.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Masked interrupt status</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_END_INT_ST</name>
              <description>The masked interrupt status bit for CH%s_TX_END_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_RX_END_INT_ST</name>
              <description>The masked interrupt status bit for CH%s_RX_END_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_ERR_INT_ST</name>
              <description>The masked interrupt status bit for CH%s_ERR_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_THR_EVENT_INT_ST</name>
              <description>The masked interrupt status bit for CH%s_TX_THR_EVENT_INT.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_LOOP_INT_ST</name>
              <description>The masked interrupt status bit for CH%s_TX_LOOP_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_END_INT_ENA</name>
              <description>The interrupt enabled bit  for CH%s_TX_END_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_RX_END_INT_ENA</name>
              <description>The interrupt enabled bit  for CH%s_RX_END_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_ERR_INT_ENA</name>
              <description>The interrupt enabled bit  for CH%s_ERR_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_THR_EVENT_INT_ENA</name>
              <description>The interrupt enabled bit for CH%s_TX_THR_EVENT_INT.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_LOOP_INT_ENA</name>
              <description>The interrupt enabled bit  for CH%s_TX_LOOP_INT.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear bits</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_END_INT_CLR</name>
              <description>Set this bit to clear the CH%s_TX_END_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_RX_END_INT_CLR</name>
              <description>Set this bit to clear the CH%s_RX_END_INT interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x3</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_ERR_INT_CLR</name>
              <description>Set this bit to clear the CH%s_ERR_INT interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_THR_EVENT_INT_CLR</name>
              <description>Set this bit to clear the CH%s_TX_THR_EVENT_INT interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>CH%s_TX_LOOP_INT_CLR</name>
              <description>Set this bit to clear the CH%s_TX_LOOP_INT interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%sCARRIER_DUTY</name>
          <description>Channel %s duty cycle configuration register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400040</resetValue>
          <fields>
            <field>
              <name>CARRIER_LOW</name>
              <description>This register is used to configure carrier wave 's low level clock period for CHANNEL%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_HIGH</name>
              <description>This register is used to configure carrier wave 's high level clock period for CHANNEL%s.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
