espressif/arduino-esp32/tools/ide-debug/svd/esp32s2.svd
        <register>
          <name>Q6_WORD1</name>
          <description>Q6_WORD1 quick_sent register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEND_Q6_WORD1</name>
              <description>This register is used as a quick_sent register when mode is specified by UHCI_ALWAYS_SEND_NUM or UHCI_SINGLE_SEND_NUM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF0</name>
          <description>Escape sequence configuration register 0</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00DCDBC0</resetValue>
          <fields>
            <field>
              <name>SEPER_CHAR</name>
              <description>This register is used to define separators to encode data packets. The default value is 0xC0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEPER_ESC_CHAR0</name>
              <description>This register is used to define the first character of SLIP escape sequence. The default value is 0xDB.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEPER_ESC_CHAR1</name>
              <description>This register is used to define the second character of SLIP escape sequence. The default value is 0xDC.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF1</name>
          <description>Escape sequence configuration register 1</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00DDDBDB</resetValue>
          <fields>
            <field>
              <name>ESC_SEQ0</name>
              <description>This register is used to define a character that need to be encoded. The default value is 0xDB that used as the first character of SLIP escape sequence.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ0_CHAR0</name>
              <description>This register is used to define the first character of SLIP escape sequence. The default value is 0xDB.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ0_CHAR1</name>
              <description>This register is used to define the second character of SLIP escape sequence. The default value is 0xDD.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF2</name>
          <description>Escape sequence configuration register 2</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00DEDB11</resetValue>
          <fields>
            <field>
              <name>ESC_SEQ1</name>
              <description>This register is used to define a character that need to be encoded. The default value is 0x11 that used as a flow control character.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ1_CHAR0</name>
              <description>This register is used to define the first character of SLIP escape sequence. The default value is 0xDB.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ1_CHAR1</name>
              <description>This register is used to define the second character of SLIP escape sequence. The default value is 0xDE.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESC_CONF3</name>
          <description>Escape sequence configuration register 3</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00DFDB13</resetValue>
          <fields>
            <field>
              <name>ESC_SEQ2</name>
              <description>This register is used to define a character that need to be decoded. The default value is 0x13 that used as a flow control character.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ2_CHAR0</name>
              <description>This register is used to define the first character of SLIP escape sequence. The default value is 0xDB.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ESC_SEQ2_CHAR1</name>
              <description>This register is used to define the second character of SLIP escape sequence. The default value is 0xDF.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_THRES</name>
          <description>Configure register for packet length</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>PKT_THRS</name>
              <description>This register is used to configure the maximum value of the packet length when UHCI_HEAD_EN is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>UHCI version  control register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x18073001</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>This is the version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
